Table of Contents
 Class ConversionDictionaryString
Namespace
IdeaStatiCa.Plugin
Assembly
IdeaStatiCa.Plugin.dll
public sealed class ConversionDictionaryString : ConversionDictionary<string>, IDictionary<string, int>, ICollection<KeyValuePair<string, int>>, IDictionary, ICollection, IReadOnlyDictionary<string, int>, IReadOnlyCollection<KeyValuePair<string, int>>, IEnumerable<KeyValuePair<string, int>>, IEnumerable, IDeserializationCallback, IXmlSerializable, ISerializable
Inheritance
object
Dictionary<string, int>
SerializableDictionary<string, int>
ConversionDictionary<string>
ConversionDictionaryString
Implements
IDictionary<string, int>
ICollection<KeyValuePair<string, int>>
IDictionary
ICollection
IReadOnlyDictionary<string, int>
IReadOnlyCollection<KeyValuePair<string, int>>
IEnumerable<KeyValuePair<string, int>>
IEnumerable
IDeserializationCallback
IXmlSerializable
ISerializable
Inherited Members
 ConversionDictionary<string>.Merge(IList<ProjectItem>)
 ConversionDictionary<string>.InitMerge(IList<ProjectItem>)
 ConversionDictionary<string>.MapId(string)
 ConversionDictionary<string>.GetExEntityId(string)
 Dictionary<string, int>.Add(string, int)
 Dictionary<string, int>.Clear()
 Dictionary<string, int>.ContainsKey(string)
 Dictionary<string, int>.ContainsValue(int)
 Dictionary<string, int>.GetEnumerator()
 Dictionary<string, int>.GetObjectData(SerializationInfo, StreamingContext)
 Dictionary<string, int>.OnDeserialization(object)
 Dictionary<string, int>.Remove(string)
 Dictionary<string, int>.TryGetValue(string, out int)
 Dictionary<string, int>.Comparer
 Dictionary<string, int>.Count
 Dictionary<string, int>.Keys
 Dictionary<string, int>.Values
 Dictionary<string, int>.this[string]
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
Methods
 GetKey(int)
protected override string GetKey(int id)
Parameters
id int
Returns
string
 GetKey(string)
protected override string GetKey(string name)
Parameters
name string
Returns
string
 GetSaveKey(int)
public override string GetSaveKey(int Id)
Parameters
Id int
Returns
string
 Edit this page